;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

(package! dash)
(package! paxedit)
(package! predd
  :recipe (:host github :repo "skeeto/predd"))
(package! direnv)
(package! alert)
(package! flycheck-clojure)
(package! evil-matchit)
(package! string-inflection)
(package! protobuf-mode)
(package! hotfuzz)
